# Задача 2
# Функция на вход получает два произвольных числа. Вывести в консоль наибольшее из чисел.

def max_num(num_1: int, num_2: int) -> int:
    if num_1 > num_2:
        print('Наибольшее число - ', num_1)
    elif num_1 == num_2:
        print('Числа: ', num_1, ' и ', num_2, ' равны')
    else:
        print('Наибольшее число - ', num_2)
    return 0

max_num(1, 3)
max_num(123, 32)
max_num(-13, 0)
max_num(10.5, 10.5)
print('\n\n')

#-------------------------------------------------------------------------------------------

# Задача 3
# Функция на вход получает два произвольных числа. Вывести в консоль “yes”,
# если они отличаются друг от друга на 135, иначе вывести на экран “No”

def diff_num(num_3: int, num_4: int) -> int:
    difference = num_3-num_4
    if difference == 135 or difference == -135:
        print('yes')
    else:
        print('no')
    return 0

diff_num(135, 0)
diff_num(1350, 14)
diff_num(-135, 0)

print('\n\n')


#-------------------------------------------------------------------------------------------

# Задача 4
# Функция на вход получает произвольное число от 1 до 12 (номер месяца).
# Вывести название сезона года в консоль (зима, весна, лето, осень)

def season(month :int) -> str:
    if month == 12 or month == 1 or month == 2:
        print('зима')
    elif month in range(3, 5):
        print('весна')
    elif month in range(6, 8):
        print('лето')
    elif month in range(9, 11):
        print('осень')
    else:
        print('введите номер месяца от 1 до 12')
    return 0

season(3.4)
season(-1)
season(0)
season(12)
season(4)

print('\n\n')


#-------------------------------------------------------------------------------------------

# Задача 5
# Функция на вход получает три произвольных числа.
# Если все числа больше 10, то вывести на экран “yes”, иначе “no”;

def yes_no(a :int, b :int, c :int) -> str:
    if a > 10 and b > 10 and c > 10:
        print('yes')
    else:
        print('no')
    return 0

yes_no(1, 3, 5)
yes_no(11, 3, 5)
yes_no(1, 30, 50)
yes_no(11, 30, 5)
yes_no(11, 30, 50)

print('\n\n')


#-------------------------------------------------------------------------------------------

# Задача 6
# 6. Функция на вход получает список, состоящий из 5 произвольных чисел.
# Найти количество положительных чисел среди них.

def positive_numbers(num_list :list) -> int:
    sum :int = 0
    for elem in num_list:
        if elem >= 0:
            sum += 1
    print(sum)
    return 0


positive_numbers([33, 2, 4, 5, 6])
positive_numbers([-33, 2, -4, 5, 0])


print('\n\n')


#-------------------------------------------------------------------------------------------

# Задача 7
# 7. Функция на вход получает 2 переменные.
# a. Кол-во лет (int)
# b. Кол-во месяцев (int)
# Вывести в консоль количество дней за это время. Считать, что в каждом месяце 29 дней.

def sum_days(years :int, month :int) -> int:
    days :int = 1
    if years >= 0:
        month += years * 12
    if month >= 0:
        days += month * 29
    days -= 1
    return print(days)


sum_days(12, 13)
sum_days(-12, 13)
sum_days(0, 13)





