s = 'это строка'
print(s + '\n')
g = '''многострочная
строка'''
print(g + '\n')
print('строки ' + 'можно ' + 'складывать')

print('Auto' * 3)
print(len('test')) #длина строки

a = 'Automation' # 0 1 2 3 4 5 6 7 8 9 10

print(a[0]) # в квадратных строках указывается индекс символа в строке
print(a[1]) # с нуля начинается первый символ, с 1 второй
print(a[-2]) # отрицательный индекс даст нам ответ - символ отчетом с другого конца
print(a[1:3]) # возьмет символы от 2 до 4 не вклячив 4 й
# пробел будет считаться символом, и также имеет индекс
